--class 테이블 insert
insert into class values
(CLASS_SEQ.nextval,'취업,승진,스펙을 위한 오픽 목표점수 달성','1','language',
85000,'22/08/16(화)14:00~15:30','서울특별시 강남구 역삼동 823 삼원타워 5층');
insert into class values
(CLASS_SEQ.nextval,'손재주가 없어도 30분만에 만들 수 있는 풍성한 꽃다발',
'2','gardening',
20000,'22/08/12(금)14:00~15:00','강남구 삼성동 소재 플라워스튜디오 아론플라워 (Aaron flower)');
insert into class values
(CLASS_SEQ.nextval,'하루만에 나만의 멋진 작품 완성! 유화 원데이클래스',
'3','drawing',
25000,'22/08/8(금)10:00~11:00','서울특별시 서대문구 증가로 53 2층 가든아트스튜디오');
insert into class values
(CLASS_SEQ.nextval,'비엠비셔스 씬에게 배우는 8월 왁킹스타일의 코레오수업',
'4','dance',
35000,'22/08/20(수)20:00~21:00','서울특별시 동작구 남부순환로 2067 6층');
COMMIT;

--content 테이블 insert
set DEFIN off;
insert into content values
(1,
'TED 영상, 아티클, etc. 같이 보고 읽은 뒤 discussion question으로 회화 수업을 진행합니다. 
Discussion 하면서 나오는 발음 교정, 표현 교정, 문법 등은 수업 후 정리해 클래스 노트로 보내드립니다.


수업 장소: 오라인 ZOOM


수업 목표:
진부한 Hi, how are you? What are your hobbies? - NO!
다양한 topic의 TED 영상 & advanced article로 진행되는 회화 수업 - YES!


얻을 수 있는 결과물:
[1:1 개인 수업]
- 1수업 = 1 article/video. 수업 1회에도 보이는 성과
- 원어민에게 받는 발음&표현&문법 등 교정
- class notes ☆인기템 class notes!☆
*class notes: 수업 중에 나온 잘못된 표현/발음/등을 정리한 노트를 복습할 수 있도록 이메일로 보내드립니다.
-클래스 노트 장점:
*그동안 회화 수업하면 내가 오늘은 뭘 배웠지...? 수업만 끝나면 내 머릿속에 지우개ㅜㅜ
☆클래스 노트를 통해 수업마다 뭘 했는지 한눈에 볼 수 있습니다!
*수업 들으랴 필기하랴 정신없으셨죠? 필기는 제가 해드립니다! 수업 중엔 오로지 수업에만 집중할 수 있습니다!


[소규모그룹 클래스]
- 1수업 = 1 article/video. 수업 1회에도 보이는 성과
- 원어민에게 받는 발음&표현&문법 등 교정
- 매주 다른 주제로 다양한 상황별 영어 습득 (ex. 여행영어, 비즈니스영어, 일상영어)',
'안녕하세요 영어강사 Penguin입니다~!

파고다 강의 평점 1등 강사 출신! 독립해서 여러분께 영어가 부담스럽지 않다는 걸 알려주겠습니다.

오래된 1:1, 그룹클래스 회화 경험 바탕으로 더 유익하고 즐거운 커리큘럼을 준비했습니다!



★ Since 2012! 다양한 티칭 경험 바탕으로 제작되는 학생 개인을 위해 최적화된 스터디 플랜


☆☆☆특별 30분 체험수업 가격입니다☆☆☆



학력:
- 14년 해외 거주
- 영어영문학과 & 심리학과 학사학위
- 영어영문학과 석사 재학


경력:
♠외식업 CEO 영어 회화 지도
♠IT 기업 CEO 영어 회화 지도
♠스타트업 CEO 영어 회화 지도
♠김*장 변호사 영어 회화 지도
♠연세* MBA 학생 영어 회화 지도
♠L* 화학, 삼*전자, 신*은행, etc. 직장인 비즈니스 영어/ 영어 회화',
'이 클래스는 1회 기준 1시간 30분씩 진행되는 수업입니다. 
무단 지각, 결석은 금지!!! 
간단한 필기도구와 교재는 미리 준비해주세요

매번 새로운 아티클/영상으로 수업을 진행합니다!
(제시된 수업 계획서는 샘플 계획서입니다. 학생의 레벨과 필요에 따라 맞춤형으로 수정되는 부분 참고 바랍니다.)

문법, 발음, 표현 등 수업 도중 나온 어색한 부분들 다 교정해드립니다. 교정된 내용은 수업 후에 클래스 노트로 정리해 이메일로 보내드립니다.

수업에서 만나요~!



[TED 수업 보카, 토론 질문 예시]

영상 제목: "Grit: The power of passion and perseverance"

-Vocabulary:
demanding job
grit
rookie
perspective
perseverance

-Discussion question ex) What is an important factor for success?',
'서울특별시 강남구 역삼동 삼원타워 5층에서 대면수업이 진행되며
비대면 ZOOM 화상 수업으로도 수강할 수 있습니다.

정규 수업은 주 2회, 총 8회 진행됩니다!');
set DEFIN off;
insert into content values
(2, --classNum
'< 아론플라워 스튜디오 - 그리너리 소재 핸드타이드 >

- 일반적이고 전형적인 꽃다발 스타일 보다는 나만의 특별한 작품을 만들어 보고 싶으신 분들을 위한,
여름 그린 소재를 이용하여 만들어보는 프렌치 스타일의 생동감 넘치는 핸드타이드 입니다.

- 형태 잡기에 아주 난이도 있는 스타일이 아니라, 손재주가 없다고 생각하시는 분들 또는
꽃을 처음 접해보시는 분들 모두 신속하고 흥미롭게 만들어 보실 수 있습니다.

- 소재의 특성과 형태에 따라 예쁜 셰입을 만드는 법, 소재에 따른 컨디셔닝 방법, 부피감이 큰 꽃을 포장하는 법 등을 학습 하실 수 있습니다.

* 모든 꽃은 시장 상황에 따라 계절 꽃으로 다양하게 준비 됩니다.', --클래스소개
'- 강남구 삼성동 소재 플라워스튜디오 아론플라워 (Aaron flower) 만 5년째 운영 중 입니다.

- 미술을 전공하였고, 색감과 형태감의 이해도를 바탕으로 유니크하고 고급스러운 플라워 어렌징을 지향합니다.

- 주로 페인팅 작품, 인테리어, 아티스트들에게서 영감을 받아 일반 꽃집에서 상품화를 목적으로 둔 작품 보다는 비교적 실험적이고 과감한 색감을 사용하여 흥미로운 플라워 디자인을 하고자 합니다.

- 플라워 클래스 ( 원데이 클래스 / 기초반 / 심화반 / 부케 집중반 등 ) 와 사전 주문 예약을 통한 생화 상품 판매, 기업 납품, 웨딩 부케 제작 등을 주 업무로 활동하고 있습니다.', --튜터소개
'- 개인 사정으로 클래스 불참 시, 평일 기준 최소 3일 전 까지 꼭 연락 부탁드립니다.

- 수업 하루 전 불참 공지 또는 당일 불참 시, 사입해둔 꽃은 이후 3일 동안 보관해드리니 최대한 빠르게 꽃을 찾아가 주시면 됩니다.

- 꽃다발의 가장 기초 원리, 스파이럴에 대하여 심도있게 학습합니다.

- 각각의 소재 형태와 특성에 맞는 컨디셔닝 방법과 포장법을 학습합니다.

( 꽃시장 상황에 따라 꽃의 종류 및 색감은 달라집니다. )', --유의사항
'- 수업 당일 현장에서 재료비 (꽃 & 부자재) 40,000원 추가 결제 됩니다.

- 수업 시간은 1시간 가량 소요 될 예정입니다. (꽃다발을 만들고 포장 - 사진 촬영 포함)

- 주차 공간이 협소하니 가급적 대중교통을 이용해 주세요. (삼성중앙역 3번 출구)

* 1:1 수업을 원하시면 상담을 통해 스케줄 조율 후 진행 가능합니다.'); --공지사항
set DEFIN off;
insert into content values
(3, --classNum
'마치 인상주의 화가의 그림처럼, 여러겹쌓여 두께감있는 유화물감만의 느낌을 살려 그릴수 있어요.
쉽게 접하기 힘든 유화를 다뤄보고, 내 손으로 그린 유화작품을 전시할 수 있어요! 
하루 소중한 시간투자로 화가가 된 듯한 기분을 느껴보세요 :)

**현재 원데이클래스는 주말(오후1시)타임만 운영중입니다. 실시간톡으로 원하시는 수업날짜를 말씀해주세요!**

최근 코로나를 비롯해 취미생활마저 이어나가기 힘든 여러 상황속에서, 하루만에 나만의 멋진 작품을 만들어가기 위한 유화 원데이클래스를 개설하게 되었어요.
유화는 재료비도 비싸고 필요한것도 많아 접하기 어렵다고 생각하시는 분들을 위해, 하루2시간의 투자로 멋진 작품을 만들어 가실수 있게 했답니다.
다양한 취미생활중 가장 힐링되는 시간, 가까운 친구나 연인 가족들과 함께 해보세요 ♥

-심각한 똥손인데 하루만에 그릴수 있을까요?
걱정마세요! 제 수업은 미술을 처음 접하는 분들의 눈높이에 가장 알맞게 진행합니다.
처음 그린다고 겁먹지 마세요 :)

-추가비용이 필요한가요?
재료비를 비롯해 캔버스값과 그 외 필요한 모든 비용이 포함되어 있습니다.
디테일이 포함된 그림을 그리실 경우 유화특성상 하루에 많이 덧칠하기 어려워 투데이로 나눠서 하시는걸 추천드려요. (수강료별도)
**원데이클래스는 2시간(최대3시간)으로 수업시간에 늦지말아주세요!**

•유화 특성상 완전건조까지 3-4주 소요됩니다.
건조후 직접 픽업을 권해드리나(파손위험) 택배발송 원하실경우 포장+배송비가 발생합니다.

•클래스는 소수인원으로 진행합니다.
수업 전,후 모든 재료와 도구의 소독과 예방을 철저히 하고있으니 안심하고 방문해주세요.
그외 수업에 관하여 궁금한 모든건 실시간톡으로 문의주세요
대관료 필요없이, 조용한 화실에서 힐링과 함께 예쁜 그림도 완성해보세요!


•안전을 위해 화실의 재료와 도구는 매일 소독과 세척하여 관리하고 손소독제가 비치되어 있으니 안심하고 방문해주세요 :)', --클래스소개
'덕성여대 서양화과 전공
KAUGE 대학연합 전시
직장인 취미미술학원 출강
아동미술. 입시미술학원 전임감사
프리랜서 일러스트레이터
현대백화점 문화센터 출강
연희동 취미미술화실 운영

안녕하세요! 튜터 이정원입니다.
탈잉을 비롯해 다양한 플랫폼과 화실에서 취미미술 강의를 하고 있답니다.
바쁘고 정신없는 일상생활에서 가장 힐링하기 좋은 취미, 그림그리기!
취미미술을 배우는 다양한 연령층과 함께하면서 제가 느낀 한가지 공통점은, 바로 창작은 누구에게나 큰 즐거움을 선사한다는 것이에요.
내손으로 직접 그리고 만드는건 지치고 힘들었던 일상에서 가장 큰 보람을 느끼게 해준답니다!
슥슥 붓질을 하다보면, 어느새 나도 모르게 완성되어 가는 그림 한점에서 나의 열정을 다시 한번 발견할 수 있어요.
저와 함께 창작의 기쁨을 나눠보세요 :)

인스타그램에서 수업사진과 작품들을 구경해보세요!', --튜터소개
'• 유화 특성상 완전 건조까지 3,4주정도 소요되어요. 건조후 직접 픽업을 권해드리나(파손위험) 택배발송 원하실경우 배송비가 발생합니다.
• 완성그림 픽업시, 최소 하루전에 연락주고 와주세요!
• 필요한 준비물과 재료들은 화실에 모두 구비되어 있으니, 설레는 마음과 열정만 가져오세요 :)

-수업은 원데이클래스로 예상소요시간은 2시간입니다.
-캔버스크기는 20x20 (정방형) / 27.3x22.0 (3호) 사이즈 중 선택합니다.


00~30분: 그리고 싶은 그림 정하고 스케치하기
◆시간 단축을 위해 미리 그리고 싶은 그림을 휴대폰에 저장해오시면 좋아요!

30분~1시간40분: 재료 사용법에 대한 간단한 설명후 채색
채색시간은 개인에 따라 다를수 있으며, 최대 2시간정도 소요됩니다.
(시간안에 완성못하여 추가진행을 원하실경우 투데이로 나눠하시는걸 추천드려요)

~2시간: 그림마무리와 포토타임
그림을 깔끔하게 마무리해 완성하고, 예쁘게 사진도 찍어서 추억을 담아보세요 :)', --유의사항
'*현재 원데이클래스는 주말(오후1시)타임만 운영중입니다. 실시간톡으로 원하시는 수업날짜를 말씀해주세요!*
네이버, 카카오맵에서 가든아트스튜디오를 검색해주세요.
필요한 재료는 모두 구비되어 있으니 가볍게 오세요!'); --공지사항
set DEFIN off;
insert into content values
(4, --classNum
'* 댄서 씬의 스타일을 배울 수 있는 코레오 수업으로,왁킹 스타일을 메인으로 가져가는 수업입니다!
‘왁킹코레오’는,
저, ‘씬’의 왁킹 스타일을 기반으로 진행되는 수업이며, 왁킹을 접해보지 않으셨던 분들도 들으실수 있는 레벨의 수업입니다. 
안무에 필요한 왁킹 동작이 있는 경우, 트레이닝 시간을 잠시 가진 후 진행되니, 참고 바랍니다!
음악은 주로 POP / K-POP 장르로 진행됩니다.

힐코레오X왁킹 은
말 그대로 힐을 신고 추는 스타일로, 남성분들은 앵글부츠도 착용 가능하며, 
왁킹스타일X힐코레오를 접목시켜 풀어낸 안무를 배우는 수업입니다. 
여성스러움과 또는 젠더리스하고 중성적임을 한 스푼 추가한 저만의 수업이라고 보시면 됩니다.
기존의 힐코레오 수업들에 트월동작들이 20%정도 들어가있다고 보시면 됩니다!', --클래스소개
'안녕하세요!
왁킹댄서로 활동중인 비 엠비셔스의 물 만난 물고기 씬입니다!

강사 활동으로는 약 8년의 경력을 가지고 있고,
왁킹 뿐만 아니라, 오디션/재즈/힐코레오 등
여러 스타일과 다양한 트레이닝을 진행하고 있습니다!

전공 장르인 왁킹수업/왁킹코레오/힐코레오 등
여러 목적에 맞게 다양한 클래스의 수업 진행이 가능하구요!

일반인/입문자/초보자 대상으로도 따라하기 쉬운 레벨의
왁킹수업도 진행중에 있습니다!

방송 직후, 처음으로 열게 되는 수업이라 많이 설렙니다!
제 춤 스타일을 배워보고 싶었던 분들께
적극적으로 추천드리는 수업입니다', --튜터소개
'* 왁킹코레오 수업
춤을 추기 편한 복장을 준비해주세요!

* 힐코레오X왁킹 수업
힐 또는 부츠를 준비해주세요
라인이 잘 드러나는 의상을 준비해주시면 됩니다!
[맨발도 가능합니다]

* 왁킹 코레오 수업

왁킹을 베이스로 가져간 코레오그래피 수업으로,
수업 직전 약간의 (왁킹) 베이직을 다룬 후, 안무 진도를 나가게 됩니다! 안무는 주 마다 새로운 안무로 진행됩니다!

[음악은 SNS-인스타그램 에 수업 전에 공지될 예정입니다!]', --유의사항
'수업 관련 안내는 SNS (인스타그램)을 통해 진행되며
기타 궁금한 사항은 DM으로 문의주시면
보다 빠른 답변이 가능합니다:)

*8월 수업 (2회)
8/4 목 8:10~9:40
8/11 목 8:10~9:40 (Heel)
두 수업 모두 다른 안무로, 원하는 날짜에 신청 가능!
(신청 후 수강희망 날짜를 튜터에게 알려주세요!)
(2회 신청 희망하실 경우, 수강인원을 희망 횟수에 맞춰서 결제 후 튜터에게 알려주시면 감사하겠습니다:)

* 탈잉 시스템 상 수업시간은 1시간으로 등록되어 있으며, 실제 수업시간은 1시간 30분으로 이에 해당하는 금액으로 측정된 바 알려드립니다!

*왁킹 코레오반은 3회분 수업으로, 왁킹코레오가 메인이며 마지막 날 하루만 특별하게 힐코레오x왁킹 으로 진행되는 수업입니다! (원데이 가능)(매 주 다른 안무)'); --공지사항
COMMIT;

--heart 테이블
INSERT INTO heart(classnum,userid,num) 
VALUES (1, '1', HEART_SEQ.nextval);
INSERT INTO heart(classnum,userid,num) 
VALUES (2, '1', HEART_SEQ.nextval);

COMMIT;